In [3]:
import pandas as pd

In [4]:
x = pd.Series([10, 20, 30, 40, 50, 'house'])
print(x)

0       10
1       20
2       30
3       40
4       50
5    house
dtype: object

In [7]:
x = pd.Series([10.9, 20.7, 30.9, 40.9, 4.9, 50, 'dog'])
print(x)

0    10.9
1    20.7
2    30.9
3    40.9
4     4.9
5      50
6     dog
dtype: object

In [8]:
x = pd.Series([50,90,89,45])
print("values of X:\n" , x)

values of X:
 0    50
1    90
2    89
3    45
dtype: int64

In [9]:
#accessing data
x[1]

90

In [12]:
#data manipulation 
print("adding 5 to a Series:\n", x +5 )
print("filtering series with greater than 30:\n")

adding 5 to a Series:
 0    55
1    95
2    94
3    50
dtype: int64
filtering series with greater than 30:

In [21]:
# a sample list containing name and age
data = [['Tom', 12], ['Harry', 30], ['Jim', 20]]
#creating  dataframe from given list with column names
df = pd.DataFrame(data, columns = ['Name', 'Age'])
df

    Name  Age
0    Tom   12
1  Harry   30
2    Jim   20

In [23]:
df.Name

0      Tom
1    Harry
2      Jim
Name: Name, dtype: object

In [25]:
df['Year'] = 2004, 2005, 2010
df

    Name  Age  Year
0    Tom   12  2004
1  Harry   30  2005
2    Jim   20  2010

In [27]:
# a sample of data containing company stock data
data = pd.DataFrame({'price':[98, 76, 73, 90],
                     'ticker':['AXP','CSCO','DIS','MSFT' ],
                     'company':['American Express', 'Cisco', 'Walt Disney', 'Microsoft']})
data

   price ticker           company
0     98    AXP  American Express
1     76   CSCO             Cisco
2     73    DIS       Walt Disney
3     90   MSFT         Microsoft

In [29]:
#inspecting top 5 rows of a dataframe
print("top five data:\n", data.head())

top five data:
    price ticker           company
0     98    AXP  American Express
1     76   CSCO             Cisco
2     73    DIS       Walt Disney
3     90   MSFT         Microsoft

In [31]:
#inspecting below 5 rows of a dataframe
print('below 5 data:\n', data.tail())

below 5 data:
    price ticker           company
0     98    AXP  American Express
1     76   CSCO             Cisco
2     73    DIS       Walt Disney
3     90   MSFT         Microsoft

In [33]:
data.describe()

           price
count   4.000000
mean   84.250000
std    11.786291
min    73.000000
25%    75.250000
50%    83.000000
75%    92.000000
max    98.000000

In [35]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   price    4 non-null      int64
 1   ticker   4 non-null      object
 2   company  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [36]:
#checking for null values
data.isnull()

   price  ticker  company
0  False   False    False
1  False   False    False
2  False   False    False
3  False   False    False

In [38]:
import numpy as np

In [40]:
#creating a sample dataframe
df = pd.DataFrame(np.random.randn(5,3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])

#creating a data with missing values by reindexing
dfs = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
dfs

        one       two     three
a -0.542582  0.370015 -0.077842
b       NaN       NaN       NaN
c  0.082033  0.187314 -1.035981
d       NaN       NaN       NaN
e  0.614342 -0.085624  1.059353
f  0.518427 -0.786517  0.473746
g       NaN       NaN       NaN
h  1.326258 -1.064163 -0.035069

In [42]:
#checking missing values using isnull()
print(dfs.isnull())
missing_values_count = dfs.isnull().sum()
print('count of missing values:\n', missing_values_count)

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False
count of missing values:
 one      3
two      3
three    3
dtype: int64

In [37]:
#removing rows that contain a missing values
dfs = dfs.dropna()
print(dfs)

        one       two     three
a  0.681203  0.419428 -0.099943
c  0.196074  0.538366 -0.317363
e  0.134991 -0.923502 -0.365557
f  1.603352 -0.357620 -0.679957
h  2.372016 -0.383991  0.426669

In [73]:
#remove all columns with at list one missing value
columns_with_na_drop = dfs.dropna(axis=1)
columns_with_na_drop.head()

        one       two     three
a  0.681203  0.419428 -0.099943
c  0.196074  0.538366 -0.317363
e  0.134991 -0.923502 -0.365557
f  1.603352 -0.357620 -0.679957
h  2.372016 -0.383991  0.426669

In [69]:
#filling NaN with zeros
df3 = dfs.fillna(0)
df3

        one       two     three
a  0.681203  0.419428 -0.099943
c  0.196074  0.538366 -0.317363
e  0.134991 -0.923502 -0.365557
f  1.603352 -0.357620 -0.679957
h  2.372016 -0.383991  0.426669

In [79]:
#replase all NA's with values that comes directly afterit in the same column
#then replace alll the remaining na's with 0
df4 = dfs.fillna(method = 'bfill', axis=0).fillna(0)
df4

C:\Users\Maureen Michael\AppData\Local\Temp\ipykernel_6500\1384582278.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df4 = dfs.fillna(method = 'bfill', axis=0).fillna(0)

        one       two     three
a  0.681203  0.419428 -0.099943
c  0.196074  0.538366 -0.317363
e  0.134991 -0.923502 -0.365557
f  1.603352 -0.357620 -0.679957
h  2.372016 -0.383991  0.426669

In [89]:
#replace all NA's with values that comes directly afterit in the same column
#then replace alll the remaining na's with 0
df4 = dfs.ffill( axis=0)
df4

        one       two     three
a  0.681203  0.419428 -0.099943
c  0.196074  0.538366 -0.317363
e  0.134991 -0.923502 -0.365557
f  1.603352 -0.357620 -0.679957
h  2.372016 -0.383991  0.426669